sim/analysis/amr/300000/ngP_01_02_1_2_5/250_40_1/constant/chemistryProperties
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  7
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant";
    object      chemistryProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

chemistryType
{
    solver          ode;
}

chemistry           on;

initialChemicalTimeStep 1e-12;

EulerImplicitCoeffs
{
    cTauChem        1;
    equilibriumRateLimiter off;
}

odeCoeffs
{
    solver          RKF45;
    absTol          1e-09;
    relTol          1e-12;
}

// ************************************************************************* //
