sim/analysis/amr/300000/ngP_01_02_1_2_5/250_40_1/system/funkySetFieldsDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  7  
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version		2.0;
    format      ascii;
    class           dictionary;
	location		"system";
    object          funkySetFieldsDict;
}

expressions
(
	TGradLHS
	{
		field		T;
		expression	"-90000 * pos().x + 1200"; // vary T from 1200K to 300K over:
		//expression	"-90000 * pos().x + 900 + 1200 * rand()"; // vary T from 1200K to 600K +/- 600K over:
		condition	"pos().x<=0.01"; //				0.01m from x=0m to x=0.01m
		keepPatches true; // keep BCs that were set before 
	}	

	Trand
	{
		field		T;
		expression	"T + 240 * rand()"; // add randomization throughout the entire domain
		keepPatches	true; // keep BCs that were set before	
	}

	pGradLHS
	{
		field		p;
		expression	"-3.03975e7 * pos().x + 405300"; // vary p from 4 atm to 1 atm over:
		condition	"pos().x<=0.01"; //						0.01m from x=0m to x=0.01m
		keepPatches	true; // keep BCs that were set before 
	}
);
